Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats
The dimension value formats.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.NoDecimals
The value is with no decimals.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.OneOptionalDecimal
The value is with one decimal if the value is not whole.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.OneDecimal
The value is with one decimal.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.TwoOptionalDecimals
The value is with two decimals if the value is not whole.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.TwoDecimals
The value is with two decimals.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.ThreeOptionalDecimals
The value is with three decimals if the value is not whole.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.ThreeDecimals
The value is with three decimals.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.RationalPart
The value is with a rational part.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats.SuperscriptEnding
The value is with superscript ending.